{"pages":[],"posts":[{"title":"Spring security 동작 원리","text":"Intro…개인 정보가 중요가 중요해지는 요즈음, 웹 사이트를 만드는데 있어서 개발자 또한 보안에 더욱 신경을 써야한다. 하지만 이제 막 개발을 시작한 내가 직접 안전한 보안, 인증, 인가 기능을 구현하기는 사실상 매우 힘들다고 볼 수 있다. 이러한 이유로 보안 관련 기능을 직접 구현하기 보다는 Spring Security를 도입하여 인증, 인가 기능을 구현하려 한다. 기능을 구현하기 앞서, Security의 특징과 동작 구조를 조사하기로 했다. 인증(Authenticate) : 웹사이트에 접근하려는 유저가 정상적인 로그인 과정을 통과하였는지 확인인가(Authorize) : 인증이 완료된 유저가 웹사이트의 특정 서비스를 요청할 때 , 해당 서비스를 요청할 권한이 있는지 확인 Spring Security 특징Spring Security의 특징은 다음과 같다. 스프링의 하위 프레임워크로서, 인증-인가와 관련된 다양한 기능을 제공. Filter 기반으로 비즈니스 로직과 분리되어 동작하므로 개발자는 비즈니스 로직에 집중할 수 있음 기본적으로 서버기반 인증(Session - cookie) 방식을 사용하지만 토큰 인증 방식도 사용 가능(spring-security-oauth2) Spring Security 동작 순서 로그인을 원하는 유저가 아이디와 비밀번호를 입력하고 로그인을 요청(HTTP Request) AuthenticationFilter가 입력받은 정보를 기반으로 UsernamePasswordAuthenticationToken을 생성, AuthenticationManager에 넘겨준다.(실제 구현체는 ProviderManager) 넘겨 받은 UsernamePasswordAuthenticationToken을 처리할 수 있는 AuthenticationProvider가 존재할 경우 UserDetailService를 통하여 DB에서 해당 유저의 정보를 가져온다. DB에서 가져온 유저 정보와 입력받은 유저 정보가 일치하면 Authentication 객체를 리턴, 일치하지 않는다면 예외를 던진다. 인증 완료된 Authentication 객체를 SecurityContextHolder에 저장한다.","link":"/2021/06/17/Spring-security-%EB%8F%99%EC%9E%91-%EC%9B%90%EB%A6%AC/"},{"title":"스프링 부트를 이용한 웹 개발 시작","text":"Intro…스프링 학습을 위해 개인 프로젝트로 지역 주민들간 물건 공유 웹사이트를 개발하여 보기로 했습니다.개발 과정에서 얻을 수 있는 새로운 지식들을 정리하기 위하여 개발 일지를 블로그에 포스팅 하겠습니다. 1. 프로젝트 목적프로젝트의 목적은 당근마켓과 비슷하게 지역성을 기반으로 한 물품 대여 웹사이트 개발입니다. 2. 개발 환경- JDK 11 - Intellij Ultimate - macOS Big Sur 3. 사용 기술1. Front End - Bootstrap - Webpack 2. Back End - Spring Boot - Spring MVC - Spring Security - Hibernate JPA 3. Database - h2 프로젝트를 진행하면서 추가되는 부분은 꾸준히 추가 하겠습니다.","link":"/2021/06/17/%EC%8A%A4%ED%94%84%EB%A7%81-%EB%B6%80%ED%8A%B8%EB%A5%BC-%EC%9D%B4%EC%9A%A9%ED%95%9C-%EC%9B%B9-%EA%B0%9C%EB%B0%9C-%EC%8B%9C%EC%9E%91/"}],"tags":[{"name":"Spring Security","slug":"Spring-Security","link":"/tags/Spring-Security/"},{"name":"스프링 시큐리티","slug":"스프링-시큐리티","link":"/tags/%EC%8A%A4%ED%94%84%EB%A7%81-%EC%8B%9C%ED%81%90%EB%A6%AC%ED%8B%B0/"},{"name":"spring","slug":"spring","link":"/tags/spring/"},{"name":"spring boot","slug":"spring-boot","link":"/tags/spring-boot/"},{"name":"spring mvc","slug":"spring-mvc","link":"/tags/spring-mvc/"}],"categories":[{"name":"Spring","slug":"Spring","link":"/categories/Spring/"}]}